Repository: phamvinh203/edusync
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Home
vi: Trang chủ

source: Classes
vi: Lớp học

source: Exercises
vi: Bài tập

source: Profile
vi: Cá nhân

# personalInfo
source: Personal Information
vi: Thông tin cá nhân

# academicInfo
source: Academic Information
vi: Thông tin học tập

source: Fee Management
vi: Quản lý học phí

source: Change Password
vi: Đổi mật khẩu

source: Settings
vi: Cài đặt

source: Theme
vi: Giao diện

source: Notifications
vi: Thông báo

source: Language
vi: Ngôn ngữ

source: Support
vi: Hỗ trợ

source: About
vi: Về ứng dụng

source: Feedback
vi: Phản hồi

source: Logout
vi: Đăng xuất

# logoutConfirm
source: Are you sure you want to logout?
vi: Bạn có chắc chắn muốn đăng xuất khỏi ứng dụng?

source: Cancel
vi: Hủy

source: Confirm
vi: Xác nhận

source: Student
vi: Học sinh

source: Teacher
vi: Giáo viên

# admin
source: Administrator
vi: Quản trị viên

source: User
vi: Người dùng

# classLabel
source: Class
vi: Lớp

source: Select Language
vi: Chọn ngôn ngữ

source: Hello!
vi: Xin chào!

source: Error loading user info
vi: Lỗi tải thông tin người dùng

source: Cannot load data
vi: Không thể tải dữ liệu

source: Reload
vi: Tải lại

# todayAssignments
source: Today's Assignments
vi: Bài tập hôm nay

source: Classes Joined
vi: Lớp học tham gia

source: Recent Activities
vi: Hoạt động gần đây

# noActivities
source: No activities yet
vi: Chưa có hoạt động nào

# todayAssignmentsCount
source: Today's Assignments ({count})
vi: Bài tập hôm nay ({count})

source: Submitted
vi: Đã nộp

source: Overdue
vi: Đã quá hạn

source: Not Submitted
vi: Chưa nộp

# deadline
source: Due
vi: Hạn

source: Just now
vi: Vừa xong

# minutesAgo
source: {minutes} minutes ago
vi: {minutes} phút trước

# hoursAgo
source: {hours} hours ago
vi: {hours} giờ trước

# daysAgo
source: {days} days ago
vi: {days} ngày trước

source: Managed Classes
vi: Lớp phụ trách

source: Students
vi: Học sinh

source: Pending Grading
vi: Bài tập chờ chấm

# todayClasses
source: Today's Classes
vi: Tiết học hôm nay

source: Quick Actions
vi: Thao tác nhanh

source: Create Exercise
vi: Tạo bài tập

source: Take Attendance
vi: Điểm danh

# todaySchedule
source: Today's Schedule ({count})
vi: Lịch dạy hôm nay ({count})

# studentCount
source: {count} students
vi: {count} học sinh

# submissionCount
source: {count} submissions
vi: {count} bài nộp

# createExerciseFeatureInDevelopment
source: Create exercise feature is under development
vi: Chức năng tạo bài tập đang được phát triển

# takeAttendanceFeatureInDevelopment
source: Take attendance feature is under development
vi: Chức năng điểm danh đang được phát triển

source: Class not updated
vi: Chưa cập nhật lớp

source: School not updated
vi: Chưa cập nhật trường

source: tutor classes
vi: lớp gia sư

source: created classes
vi: lớp đã tạo

# classCreatedSuccess
source: Successfully created class "{className}"!
vi: Đã tạo lớp "{className}" thành công!

source: School Subjects
vi: Môn học trường

# tutorClassesTab
source: Tutor Classes
vi: Lớp gia sư

source: Schedule
vi: Lịch học

# classInfo
source: Class Information:
vi: Thông tin lớp:

# schoolInfo
source: School
vi: Trường

source: subjects
vi: môn học

source: Create New Class
vi: Tạo lớp học mới

source: Subject
vi: Môn học

# gradeLevel
source: Grade
vi: Lớp

# teacherName
source: Teacher
vi: Giáo viên

# scheduleLabel
source: Schedule:
vi: Lịch học:

source: Location
vi: Địa chỉ

# todayAttendance
source: Today's Attendance
vi: Điểm danh hôm nay

source: Date
vi: Ngày

source: Attendance History
vi: Lịch sử điểm danh

source: No history
vi: Chưa có lịch sử

source: Present
vi: Có mặt

source: Class Attendance
vi: Điểm danh lớp học

source: Save Attendance
vi: Lưu điểm danh

# createClass
source: Create New Class
vi: Tạo lớp học mới

# basicInfo
source: Basic Information
vi: Thông tin cơ bản

source: Class Name *
vi: Tên lớp học *

source: Enter class name
vi: Nhập tên lớp học

source: Please enter class name
vi: Vui lòng nhập tên lớp học

# subjectName
source: Subject *
vi: Môn học *

source: Enter subject
vi: Nhập môn học

source: Please enter subject
vi: Vui lòng nhập môn học

source: Extra Class
vi: Lớp dạy thêm

# extraClassHint
source: E.g: Grade 12, Grade 10, ...
vi: Ví dụ: Lớp 12, Lớp 10, ...

# pricePerSession
source: Price per Session (VND)
vi: Giá tiền cho 1 buổi học (VNĐ)

# priceHint
source: E.g: 20,000
vi: Ví dụ: 20.000

# pleaseEnterValidPrice
source: Please enter a valid price
vi: Vui lòng nhập số tiền hợp lệ

source: Description
vi: Mô tả

# descriptionHint
source: Enter full description for the exercise...
vi: Mô tả chi tiết về bài tập...

# locationLabel
source: Location
vi: Địa điểm

# locationHint
source: Enter study location
vi: Nhập địa điểm học

# maxStudents
source: Maximum Students
vi: Số học viên tối đa

# maxStudentsHint
source: Enter maximum number of students
vi: Nhập số học viên tối đa

# pleaseEnterValidNumber
source: Please enter a valid number
vi: Vui lòng nhập số hợp lệ

source: Add Schedule
vi: Thêm lịch học

source: Schedule {number}
vi: Lịch học {number}

source: Enter Class Code
vi: Nhập mã lớp

# enterClassCodeDescription
source: Enter the class code provided by your teacher to join the school class.
vi: Nhập mã lớp do giáo viên cung cấp để tham gia lớp học chính khóa.

source: Join Class
vi: Tham gia lớp học

source: No Subjects Yet
vi: Chưa có môn học nào

# enterCodeToJoin
source: Enter the class code provided by your teacher to start joining school subjects
vi: Nhập mã lớp do giáo viên cung cấp để bắt đầu tham gia các môn học chính khóa

# enterClassCodeButton
source: Enter Class Code
vi: Nhập mã lớp học

# classesCreated
source: {count} classes created
vi: {count} lớp học đã tạo

source: No Classes Yet
vi: Chưa có lớp học nào

# createFirstClass
source: You haven't created any school classes yet. Create a new class to get started.
vi: Bạn chưa tạo lớp học chính khóa nào. Tạo lớp học mới để bắt đầu.

source: Data Load Error
vi: Lỗi tải dữ liệu

source: Retry
vi: Thử lại

# noTutorRegistered
source: No Tutor Classes Registered
vi: Chưa đăng ký lớp gia sư nào

# noTutorCreated
source: No Tutor Classes Yet
vi: Chưa có lớp gia sư nào

# findTutorClasses
source: Find and register for suitable tutor classes
vi: Tìm và đăng ký lớp gia sư phù hợp

# createFirstTutorClass
source: Create your first tutor class
vi: Tạo lớp gia sư đầu tiên của bạn

# findTutorButton
source: Find Tutor Classes
vi: Tìm lớp gia sư

source: Registration Applications
vi: Đơn đăng ký

# noTeacherIdError
source: Teacher ID not found. Please log in again.
vi: Không tìm thấy Teacher ID. Vui lòng đăng nhập lại.

source: Created
vi: Đã tạo

# joined
source: Joined Class
vi: Đã tham gia lớp

# teacherLabel
source: Teacher
vi: GV

# youSelectedClass
source: You selected class {className}
vi: Bạn đã chọn lớp {className}

source: Tutor
vi: Gia sư

source: Detail
vi: Chi tiết

# classCodeLabel
source: Class Code
vi: Mã lớp học

# classCodeHint
source: Example: 5LG9HA
vi: Ví dụ: 5LG9HA

source: Please enter class code
vi: Vui lòng nhập mã lớp học

source: Joining...
vi: Đang tham gia...

# joinSuccess
source: Successfully joined the class
vi: Tham gia lớp học thành công

source: Filter by grade
vi: Lọc theo lớp

source: All grades
vi: Tất cả lớp

# errorPrefix
source: Error
vi: Lỗi

# registerTutorClass
source: Register for Tutor Class
vi: Đăng ký lớp gia sư

# addressLabel
source: Address
vi: Địa chỉ

source: Register
vi: Đăng ký

source: No schedule yet
vi: Chưa có lịch học

source: Confirm Delete
vi: Xác nhận xóa

# confirmDeleteMessage
source: Are you sure you want to remove this student from the pending list?
vi: Bạn có chắc chắn muốn xóa học sinh này khỏi danh sách chờ duyệt?

source: Delete
vi: Xóa

source: Confirm Approve
vi: Xác nhận duyệt

# confirmApproveMessage
source: Are you sure you want to approve this student to join the class?
vi: Bạn có chắc chắn muốn duyệt học sinh này vào lớp?

source: Approve
vi: Duyệt

# loadingPendingStudents
source: Loading pending students list...
vi: Đang tải danh sách học sinh chờ duyệt...

source: No pending students
vi: Không có học sinh nào đang chờ duyệt

# classInfoNotFound
source: Class information not found
vi: Không tìm thấy thông tin lớp học

source: Feature in development
vi: Tính năng đang phát triển

# confirmDeleteClass
source: Are you sure you want to delete this class?
vi: Bạn có chắc chắn muốn xóa lớp học này không?

# deleteClassError
source: Error deleting class: {error}
vi: Lỗi khi xóa lớp học: {error}

# classTimeLabel
source: Time: {startTime} - {endTime}
vi: Giờ học: {startTime} - {endTime}

# createClassSuccess
source: Class created successfully!
vi: Tạo lớp học thành công!

# addScheduleDialog
source: Add Schedule
vi: Thêm lịch học

source: Start Time
vi: Giờ bắt đầu

source: End Time
vi: Giờ kết thúc

# endTimeMustBeAfterStart
source: End time must be after start time
vi: Giờ kết thúc phải sau giờ bắt đầu

source: Save
vi: Lưu

source: Attendance
vi: Điểm danh

# noAttendanceHistory
source: No history
vi: Chưa có lịch sử

# attendanceDialog
source: Class Attendance
vi: Điểm danh lớp học

source: Student {number}
vi: Học sinh {number}

# classGrade
source: Grade
vi: Lớp

# descriptionLabel
source: Description (optional)
vi: Mô tả (tùy chọn)

# subjectLabel
source: Subject
vi: Môn học

# studentCount2
source: Number of Students
vi: Số lượng học sinh

source: Created Date
vi: Ngày tạo

source: Available Tutor Classes
vi: Danh sách lớp gia sư

# noTutorClassesAvailable
source: No tutor classes available at the moment
vi: Hiện tại chưa có lớp gia sư nào

# registerSuccess
source: Successfully registered! Please wait for teacher's approval.
vi: Đăng ký lớp thành công! Vui lòng chờ giáo viên duyệt.

# registerError
source: Registration error
vi: Lỗi khi đăng ký

source: Registering...
vi: Đang đăng ký...

source: Tuition Fee
vi: Học phí

# perSession
source: VND/session
vi: VNĐ/buổi

# alreadyRegistered
source: You have already registered for this class
vi: Bạn đã đăng ký lớp này

# confirmRegister
source: Do you want to register for class "{className}"?
vi: Bạn có muốn đăng ký vào lớp "{className}"?

# createClassButton
source: Create Class
vi: Tạo lớp học

# classNameRequired
source: Class Name *
vi: Tên lớp học *

# subjectRequired
source: Subject *
vi: Môn học *

source: Register to Join
vi: Đăng ký tham gia

# registering2
source: Registering...
vi: Đang đăng ký...

# waitingForApproval
source: Waiting for teacher approval
vi: Đang chờ giáo viên duyệt

source: Class Full
vi: Lớp đã đầy

# studentsLabel
source: Students
vi: Học sinh

# spotsAvailable
source: Available
vi: Còn trống

# tuitionFeeLabel
source: Tuition Fee
vi: Học phí

# subjectPrefix
source: Subject:
vi: Môn học:

# gradePrefix
source: Grade:
vi: Lớp:

# teacherPrefix
source: Teacher:
vi: Giáo viên:

# schedulePrefix
source: Schedule:
vi: Lịch:

# addressPrefix
source: Address:
vi: Địa chỉ:

# classDetailInfo
source: Detailed Information
vi: Thông tin chi tiết

# studentCountLabel
source: Number of Students
vi: Số lượng học sinh

# studentCountValue
source: {current}/{max} students
vi: {current}/{max} học sinh

source: Class Schedule
vi: Lịch học

source: Students in Class
vi: Học sinh trong lớp

source: No students yet
vi: Chưa có học sinh nào

# noStudentsDescription
source: No students have joined this class yet
vi: Lớp học chưa có học sinh nào tham gia

# errorLoadingClass
source: Error loading class information
vi: Lỗi khi tải thông tin lớp học

source: Try Again
vi: Thử lại

# pendingClasses
source: Pending Classes List
vi: Danh sách lớp đang chờ duyệt

source: No pending classes
vi: Không có lớp nào đang chờ duyệt

# confirmRemoveStudent
source: Are you sure you want to remove student "{studentName}" from the pending list?
vi: Bạn có chắc chắn muốn xóa học sinh "{studentName}" khỏi danh sách chờ duyệt?

# studentRemoved
source: Removed student {studentName} from pending list
vi: Đã xóa học sinh {studentName} khỏi danh sách chờ duyệt

# errorRemovingStudent
source: Error removing student: {error}
vi: Lỗi khi xóa học sinh: {error}

# confirmApproveStudent
source: Are you sure you want to approve student "{studentName}" to join the class?
vi: Bạn có chắc chắn muốn duyệt học sinh "{studentName}" vào lớp học?

# studentApproved
source: Approved student {studentName}
vi: Đã duyệt học sinh {studentName}

# errorApprovingStudent
source: Error approving student: {error}
vi: Lỗi khi duyệt học sinh: {error}

# pendingStudentsTitle
source: Pending Students
vi: Học sinh chờ duyệt

# pendingStudentsCount
source: {count} pending students
vi: {count} học sinh chờ duyệt

# approveInstruction
source: Click "Approve" button to confirm students into the class
vi: Nhấn vào nút "Duyệt" để xác nhận học sinh vào lớp

# allStudentsApproved
source: All students have been approved or no one has registered yet
vi: Tất cả học sinh đã được duyệt hoặc chưa có ai đăng ký

source: Start Attendance
vi: Bắt đầu điểm danh

source: Today - {date}
vi: Hôm nay - {date}

source: Attendance started
vi: Đã bắt đầu điểm danh

# errorStartingAttendance
source: Error starting attendance: {error}
vi: Lỗi khi bắt đầu điểm danh: {error}

source: Absent
vi: Vắng mặt

# attendanceSaved
source: Attendance saved successfully
vi: Đã lưu điểm danh thành công

# errorSavingAttendance
source: Error saving attendance: {error}
vi: Lỗi khi lưu điểm danh: {error}

source: Essay Exercise
vi: Bài tập tự luận

source: Submit Exercise
vi: Nộp bài

source: Submitting...
vi: Đang nộp...

source: Please answer all questions
vi: Vui lòng trả lời tất cả câu hỏi

# mcqSummaryTitle
source: MCQ Submission
vi: Bài làm trắc nghiệm

# submitSuccessScore
source: Submission succeeded! Score: {score}/{max}
vi: Nộp bài thành công! Điểm: {score}/{max}

# submitError
source: Error submitting exercise: {error}
vi: Lỗi nộp bài: {error}

# enterContentOrFile
source: Please enter content or pick a file.
vi: Vui lòng nhập nội dung hoặc chọn tệp.

# enterValidGrade
source: Please enter a valid grade
vi: Vui lòng nhập điểm hợp lệ

# gradeRange
source: Grade must be between 0 - {max}
vi: Điểm phải nằm trong khoảng 0 - {max}

# downloaded
source: Downloaded: {fileName}
vi: Đã tải xuống: {fileName}

# fileDownloadError
source: File download error: {error}
vi: Lỗi tải tệp: {error}

# submissionsListTitle
source: Submitted Students List
vi: Danh sách học sinh đã nộp

# noSubmissionsYet
source: No students have submitted yet
vi: Chưa có học sinh nào nộp

source: Unknown
vi: Không rõ

source: Unknown time
vi: Không rõ thời gian

source: Essay
vi: Tự luận

source: Multiple Choice
vi: Trắc nghiệm

# timeLeftDays
source: Remaining {days} days
vi: Còn {days} ngày

# timeLeftHours
source: Remaining {hours} hours
vi: Còn {hours} giờ

# timeLeftMinutes
source: Remaining {minutes} minutes
vi: Còn {minutes} phút

source: No exercises
vi: Không có bài tập

# noQuestionsInMcq
source: This MCQ exercise has no questions
vi: Bài tập trắc nghiệm chưa có câu hỏi

source: MCQ Exercise
vi: Làm bài trắc nghiệm

# questionCount
source: {count} questions
vi: {count} câu

# questionLabel
source: Question {number}
vi: Câu {number}

source: Multiple answers
vi: Nhiều đáp án

# enterContentLabel
source: Enter content
vi: Nhập nội dung

# contentHint
source: Write your answer... (can be empty if attaching a file)
vi: Viết câu trả lời... (có thể để trống nếu nộp tệp)

source: Pick file
vi: Chọn tệp

# submitSuccessMessage
source: Submission succeeded
vi: Nộp bài thành công

source: Manage
vi: Quản lý

source: View Result
vi: Xem kết quả

source: View Detail
vi: Xem chi tiết

source: Do Exercise
vi: Làm bài

# submittedStudentsTitle
source: Submitted Students
vi: Danh sách học sinh đã nộp

source: Error loading list
vi: Lỗi tải danh sách

# unknownStudent
source: Unknown
vi: Không rõ

# scorePrefix
source: Score
vi: Điểm

source: Has feedback
vi: Đã nhận xét

source: Not graded
vi: Chưa chấm

# invalidGrade
source: Please enter a valid grade
vi: Vui lòng nhập điểm hợp lệ

source: Graded
vi: Đã chấm

source: points
vi: điểm

# gradeError
source: Grading error
vi: Lỗi chấm điểm

source: Submitted at
vi: Nộp lúc

# lateSubmission
source: Late
vi: Nộp muộn

source: Submission Content
vi: Đã nộp

source: Attachments
vi: Tệp đính kèm

source: Created at
vi: Tạo lúc

# yourScore
source: Your score: {score}/{max}
vi: Điểm của bạn: {score}/{max}

source: Your submission: Not graded
vi: Bài nộp của bạn: Chưa chấm

source: Redo exercise
vi: Làm lại bài tập

# redoConfirmationContent
source: Are you sure you want to redo? The previous submission will be permanently deleted.
vi: Bạn có chắc chắn muốn làm lại? Bài nộp trước đó sẽ bị xóa hoàn toàn.

# submissionNotFound
source: Submission to delete not found
vi: Không tìm thấy bài nộp để xóa

source: Deleting old submission...
vi: Đang xóa bài nộp cũ...

source: File upload
vi: Nộp file

# statusClosed
source: Closed
vi: Đã đóng

# statusOpen
source: Open
vi: Đang mở

# pleaseSelectDueDate
source: Please select a due date
vi: Vui lòng chọn hạn nộp bài

source: Please add at least one question
vi: Vui lòng thêm ít nhất một câu hỏi

# createExerciseSuccess
source: Exercise created successfully!
vi: Tạo bài tập thành công!

# exerciseTitleLabel
source: Exercise Title
vi: Tiêu đề bài tập

# enterExerciseTitle
source: Enter title for the exercise...
vi: Nhập tiêu đề cho bài tập...

# subjectHintExamples
source: Math, Literature, English...
vi: Toán, Văn, Anh...

# createExerciseButton
source: Create Exercise
vi: Tạo bài tập

# pleaseEnterTitle
source: Please enter a title
vi: Vui lòng nhập tiêu đề

# positiveIntegerError
source: Must be a positive integer
vi: Phải là số nguyên dương

source: Exercise Settings
vi: Cài đặt bài tập

source: All
vi: Tất cả

source: Manage Exercises
vi: Quản lý bài tập

# exerciseDetailTitle
source: Exercise details
vi: Chi tiết bài tập
